Revit 2025 API
EnergyAnalysisOpeningType Enumeration
 Energy analysis opening type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum EnergyAnalysisOpeningType
Public Enumeration EnergyAnalysisOpeningType
public enum class EnergyAnalysisOpeningType
type EnergyAnalysisOpeningType
Members
Member name | Value | Description
Door | 0 |  Door.
Window | 1 |  Window.
Skylight | 2 |  Skylight.
Air | 3 |  Air.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace